{"data":{"markdownRemark":{"html":"<p>Seated with a tall beer in this damp, warmly lit Broc’Bar in Lyon, I’m\ndebuting my updated website with its updated blog, so: welcome! Bienvenue!\nI’m happy that you’re taking the time to read this.</p>\n<p>I updated my website to reflect a new chapter in my life, one in which I’m\nhopeful, grateful, and open to whatever may come. This past year, after turning\n27 (also my golden year, since my birthday occured on a 27th of a month), I\nencountered a breakthrough that it was imperative to test many assumptions,\nexpectations, and fears that accumulated over the years. As I was entering into\ngreater stability in my life, I felt like it was important to not fall into my\ncomfort zone, and to remember to attempt doing things that have always seemed\nchallenging and scary to me.</p>\n<p>So far, what that’s looked like is that I quit my job to take some time to\npursue my artistic/creative projects, and to travel. I’ve always wanted to\nlive outside of the United States for a considerable duration of time longer\nthan a typical vacation, so I’m in France for at least 2.5 months doing just\nthat. I'm spending a majority of my time in <a href=\"https://en.wikipedia.org/wiki/Lyon\">Lyon</a>, where I'm drawing, painting, exploring, writing, climbing, and meeting new people, and some of the rest travelling to the South of France, Spain, and Portugal.</p>\n<p>It’s been less than a week since I’ve been here, and it’s been a whole\nexperience of excitement, adjustment, anxiety, beautiful sunsets, sweaty\nwalks, and meeting new people. And I’m <em>so</em> excited to see what more will\nunfold over the next few months.</p>\n<p>More on that for later. As I’m soaking up this apéro hiding away from the\nrain outside, tucked into the interior of this cafe, yet still connected to\neveryone sitting outside, I’m going to spend time on one of my artistic\nprojects.</p>","frontmatter":{"title":"Transitionally","date":"2018-08-06","subtitle":"I quit my job to live in France for 2.5 months.","featured_image":"./featured_image.jpg"}}},"pageContext":{"slug":"/2018/08/transitional/"}}