{"data":{"markdownRemark":{"html":"<div class=\"work_section overview col_full\">\n  <div class=\"col\">\n    <p>\n      From 2015-2017, I led the product design to develop content warnings on\n      Facebook to help people deal with unexpected, sensitive content that they\n      encounter on Facebook. I understood, strategized, and collaborated with\n      an interdisciplinary team to weigh different considerations and\n      capacities from Facebook’s Policy and Machine-Learning team, to our\n      international research team, with implementing an experience that would\n      best solve our community’s needs. I also presented the strategy and\n      design directly to Mark Zuckerberg to receive his feedback and guidance.\n      <strong>Today, the content warning is accessible on all platforms (web,\n      iOS, Android) to 100% of Facebook’s global market, viewable most\n      popularly on the News Feed. <u>It resulted in higher sentiment and decreased\n      reporting of negative content on Facebook.</u></strong>\n    </p>\n  </div>\n</div>\n<div class=\"work_section no_margin col_full_stretch\">\n  <div class=\"col\">\n    <figure>\n      <img src=\"/assets/images/work/fb_content_warnings/project_overview.png\" />\n    </figure>\n  </div>\n</div>\n<div class=\"work_section col_full\">\n  <div class=\"col\">\n    <h5 class=\"work_section_title\">\n      Understanding the Problem\n    </h5>\n    <h2>\n      When people go onto Facebook and unexpectedly encounter sensitive\n      content, it is a jarring experience that bothers them.\n\t\t</h2>\n\t\t<p>\n      Sometimes, seeing this graphic content without any warnings triggers past\n      trauma. Other times, it results in pure embarassment if they’re browsing\n      Facebook in public. <strong>In the inevitable situation where Facebook\n      can’t proactively remove potentially offensive or suggestive content, how\n      can we offer a remediary experience?</strong>\n    </p>\n\t\t<p>\n      Employing the jobs-to-be-done approach to UX design and research, I\n      sought to understand what the community did <strong>today</strong> to\n      deal with the issues they encountered. Working with my team’s data\n      scientist, we noted that the high volume of reported content indicated\n      that people were emboldened to take action on such content. Although\n      about 2.9% of content viewed on Facebook are sexually suggestive,\n      non-policy-violating, only about 0.07% of sexual/nude content viewed on\n      Facebook violate its policy.\n\t\t</p>\n\t\t<p>\n      If not all of this content can be removed, <strong>what more can we\n      do?</strong>\n\t\t</p>\n  </div>\n</div>\n<div class=\"work_section col_full\">\n  <div class=\"col\">\n    <h5 class=\"work_section_title\">\n      The Crux\n    </h5>\n    <h2>\n      When people share content on Facebook, it is an expression of their\n      values, identity, and personhood online. Moderating content on Facebook\n      is not only about aiding the needs of the viewer, but also respecting the\n      freedom of expression for the poster.\n    </h2>\n  </div>\n</div>\n<hr>\n<div class=\"work_section col_full\">\n  <div class=\"col\">\n    <h2>\n      Approaching a Strategy\n    </h2>\n\t\t<p>\n      Given the complexity of our different users’ needs, what considerations must we\n      acknowledge if we implemented warning screens on Facebook? We asked ourselves:\n\t\t</p>\n\t\t<p>\n\t\t\t<ol>\n\t\t\t\t<li>\n          How do we resolve the pain points of the person seeing unwanted\n          content, with the freedom of expression we grant to person who\n          posted such content in the first place?\n\t\t\t\t</li>\n\t\t\t\t<li>\n          How do we give people control over how “strict” the content warning should be?\n          And how we give them control when they think that Facebook has incorrectly\n          covered up innocuous content?\n\t\t\t\t</li>\n\t\t\t\t<li>\n          How would we design and implement an adaptable, modular product experience that\n          could apply to various “story” formats on Facebook, a product on which numerous\n          product teams drive their unique product direction (written post, photos,\n          videos, and other miscellaneous formats)?\n\t\t\t\t</li>\n\t\t\t</ol>\n\t\t</p>\n  </div>\n</div>\n<hr>\n<div class=\"work_section col_full highlight align_center\">\n  <div class=\"col\">\n    <h2>\n      Defining Our Principles\n    </h2>\n    <p class=\"special_paragraph\">\n      In order to guide the team to make decisions around these complex\n      considerations, I collaborated with my team's content strategist to\n      brainstorm and design product principles:\n    </p>\n    <article class=\"list_item\">\n      <div class=\"list_counter\">\n        <h5 class=\"list_counter_value\">\n          01\n        </h5>\n      </div>\n      <div class=\"list_content\">\n        <h4 class=\"list_content_title\">\n          Clarity\n        </h4>\n        <p class=\"list_content_description\">\n          Communicate to users that this content is concealed, and why.\n        </p>\n      </div>\n    </article>\n<pre><code>&#x3C;article class=\"list_item\">\n  &#x3C;div class=\"list_counter\">\n    &#x3C;h5 class=\"list_counter_value\">\n      02\n    &#x3C;/h5>\n  &#x3C;/div>\n  &#x3C;div class=\"list_content\">\n    &#x3C;h4 class=\"list_content_title\">\n      Control\n    &#x3C;/h4>\n    &#x3C;p class=\"list_content_description\">\n      Give affordance for users to cover and uncover this photo/video.\n    &#x3C;/p>\n  &#x3C;/div>\n&#x3C;/article>\n\n&#x3C;article class=\"list_item\">\n  &#x3C;div class=\"list_counter\">\n    &#x3C;h5 class=\"list_counter_value\">\n      03\n    &#x3C;/h5>\n  &#x3C;/div>\n  &#x3C;div class=\"list_content\">\n    &#x3C;h4 class=\"list_content_title\">\n      Voice\n    &#x3C;/h4>\n    &#x3C;p class=\"list_content_description\">\n      If the content warning is connected to a user setting, then give\n      users the option to flag this content warning as a false positive\n      or to edit their user settings.\n    &#x3C;/p>\n  &#x3C;/div>\n&#x3C;/article>\n</code></pre>\n  </div>\n  <figure>\n    <img src=\"/assets/images/work/fb_content_warnings/principles.png\" />\n  </figure>\n</div>\n<div class=\"work_section col_full\">\n  <div class=\"col\">\n    <h5 class=\"work_section_title\">\n      Initial Explorations\n    </h5>\n    <h2>\n      What could content warnings look like?\n    </h2>\n\t\t<p>\n      Both the aforementioned considerations and the product principles provide\n      some constraints for the next phase, which is to broadly explore the\n      possibilities of what how this content warning can take shape. During\n      this initial phase, it is important to explore widely and divergent in\n      order to expose any limitations of our technical capacity, highlight any\n      philosophical questions we'd need to address, and uncover any \"edge\n      cases\" we may not had been thinking of previously.\n\t\t</p>\n  </div>\n</div>\n<div class=\"work_section no_margin col_full_stretch\">\n  <div class=\"col\">\n    <figure>\n      <img src=\"/assets/images/work/fb_content_warnings/breadth.png\" />\n    </figure>\n  </div>\n</div>\n<div class=\"work_section col_full\">\n  <div class=\"col\">\n\t\t<p>\n      One stream of explorations I delved into was understanding how much\n      content the content warning should cover.\n\t\t</p>\n\t\t<p>\n      Since one of the primary considerations was to balance alleviating the\n      painful experience for the viewer, with the freedom expression of the\n      content creator, I focused my design explorations with this in mind.\n\t\t</p>\n  </div>\n</div>\n<div class=\"work_section no_margin col_full_stretch\">\n  <div class=\"col\">\n    <figure>\n      <img src=\"/assets/images/work/fb_content_warnings/cw_variation_1.png\" />\n    </figure>\n  </div>\n</div>\n<div class=\"work_section col_full\">\n  <div class=\"col\">\n    <h2>\n      Presenting Our Point of View to Mark Zuckerberg\n    </h2>\n\t\t<p>\n      After many continued explorations and feedback sessions from my peers,\n      who included product designers, researchers, and engineers from my Safety\n      and Security team, as well as those from the News Feed team, I refined\n      the concept to the video shown below: a content warning blurring only the\n      related visual content (photo or video), that lets the user know why it's\n      covered, what they can do if they continue to see unwanted content, and a\n      way to let Facebook know if it accidentally covered innocuous content.\n\t\t</p>\n\t\t<h4>\n      Given the intense sensitivity of what my team was conceiving and its\n      possible and grave implications for the community and for Facebook, this\n      concept went through ample review at the executive level. With my core\n      team in attendance, I presented this design concept directly to Mark\n      Zuckerberg to receive his feedback around the design execution, the\n      technical execution, and the unanswered questions we needed a gut check\n      from him on.\n\t\t</h4>\n  </div>\n</div>\n<div class=\"work_section no_margin gif col_full\">\n  <div class=\"col\">\n    <figure>\n      <img src=\"/assets/images/work/fb_content_warnings/cw_version_1.gif\">\n      <figcaption>\n        Early video demo of a prototype concept\n      </figcaption>\n    </figure>\n  </div>\n</div>\n<div class=\"work_section col_full\">\n  <div class=\"col\">\n\t\t<p>\n      Mark encouraged our team to continue to iterate on our messaging and\n      presentation of the content warning overlay, as well as its settings, so\n      that it did not convey a judgement around someone's personal morals\n      around content they don't want to see.\n\t\t</p>\n  </div>\n</div>\n<hr>\n<div class=\"work_section col_full\">\n  <div class=\"col\">\n    <h2>\n      Iterating After Mark Zuckerberg's Feedback\n    </h2>\n\t\t<p>\n      After the review with Mark, I continued to iterate on my content\n      warnings and the settings. Given the expanding scope of the original\n      project, I drove the team to differentiate the two specific workstreams\n      we were beginning to work within. Even though they were closely related,\n      they needed to be distinct so that we can be focused in our\n      problem-solving and investigation.\n\t\t</p>\n\t\t<p>\n      With <strong>content warnings</strong>, I iterated upon developing a\n      modular, flexible content warning that can support the right messaging\n      for our community. I worked closely with the content strategist and with\n      policy to gather their feedback and needs.\n\t\t</p>\n  </div>\n</div>\n<div class=\"work_section no_margin col_full_stretch\">\n  <div class=\"col\">\n    <figure>\n      <img src=\"/assets/images/work/fb_content_warnings/exploration_warnings.png\" />\n    </figure>\n  </div>\n</div>\n<hr>\n<div class=\"work_section col_full\">\n  <div class=\"col\">\n\t\t<p>\n    With <strong>Settings</strong>, I continued to explore what a\n    community-moderated content preference settings might look like on\n    Facebook. Gathering the known requirements from the Policy and our\n    Engineering team, we explored and focused in on three possible directions\n    that we needed to validate and understand better.\n\t\t</p>\n\t\t<p>\n      How do people feel about their \"community\" helping moderate content that\n      they see on Facebook? What do people even consider to be flagrant\n      content? We had a lot of hypotheses but not enough clear evidence,\n      especially at a global scale. Thus, we set out on a research trip.\n\t\t</p>\n  </div>\n</div>\n<div class=\"work_section no_margin col col_2\">\n  <div class=\"work_section_body_container\">\n    <figure>\n      <img src=\"/assets/images/work/fb_content_warnings/exploration_settings_1.png\" />\n    </figure>\n  </div>\n</div>\n<div class=\"work_section col_full\">\n  <div class=\"col\">\n    <h5 class=\"work_section_title\">\n      User Research\n    </h5>\n    <h2>\n      We went to India, Germany, Indonesia, and Mexico to better understand how\n      people think about their community's role in determining how content\n      moderation might work on Facebook.\n    </h2>\n    <p>\n      There were numerous questions and hypotheses we sought to better\n      understand during this trip. The key themes were:\n<pre><code>  &#x3C;ul class=\"styled\">\n    &#x3C;li>\n      &#x3C;strong>\n        What is Facebook's role in handling content described as sexually\n        suggestive, hate speech, violence/gore, et cetera?\n      &#x3C;/strong>\n        This necessitated us to understand how the participants categorize\n        and describe such content.\n    &#x3C;/li>\n    &#x3C;li>\n      &#x3C;strong>\n        How much do they trust their community's ability to help moderate\n        this content on Facebook?\n      &#x3C;/strong>\n        This required better understanding how they describe \"community\":\n        is it defined by shared interests? Demographics? Location?\n        it were a location, how might that work on a global scale?\n    &#x3C;/li>\n    &#x3C;li>\n      &#x3C;strong>\n        Which interaction design patterns best match their expectations\n        when dealing with such content?\n      &#x3C;/strong>\n    &#x3C;/li>\n  &#x3C;/ul>\n&#x3C;/p>\n</code></pre>\n  </div>\n</div>\n<hr>\n<div class=\"work_section col_6 align_center\">\n  <div class=\"col\">\n    <figure>\n      <img src=\"/assets/images/work/fb_content_warnings/research_indonesia.jpg\" />\n    </figure>\n  </div>\n  <div class=\"col\">\n    <p>\n      During to the complexities of these questions, we answered them through a\n      variety of methods: qualitative (interviews, categorical card-sorting,\n      focus group discussions), and quantitative (usability testing).\n    </p>\n    <p>\n      For the individual research sessions, we talked with each participant for\n      about 2 hours. In total, we spoke directly with 200 people spanning four\n      continents.\n    </p>\n  </div>\n</div>\n<hr>\n<div class=\"work_section col_full\">\n  <div class=\"col\">\n    <h2>Key Takeaways</h2>\n    <p>\n      After two intensive weeks of international research, we came away with\n      these key takeaways:\n    </p>\n    <p>\n      <ul class=\"styled\">\n        <li>\n          <strong>Community is subjective...</strong><br>\n          Across the diversity of race, religious affiliation, social class,\n          sexual orientation, gender identity, geographic location, interests,\n          countries, and languages of people we talked to, there are ample\n          nuances and no definitive consensus of a definition of a \"community\".\n          Simply put, a community is a group of people, but the definition of\n          the group changes meaning and context during different circumstances.\n        </li>\n        <li>\n          <strong>... so is what people consider flagrant on\n          Facebook.</strong><br> Not only do people define their \"community\"\n          subjectively, but so too is what they consider to be flagrant on\n          Facebook. This affirmed our primary aim of giving people control to\n          see what they want to see on Facebook, validating our content warning\n          feature.\n        </li>\n        <li>\n          <strong>General UX/UI Feedback/Content</strong><br> After testing 3\n          variations of the content warning settings, we found that people\n          wanted that the words they'd see to describe this content warning\n          matters just as much as the UX/UI showcasing it. Following our\n          direction, here were iterations I came up with afterwards.\n        </li>\n      </ul>\n    </p>\n  </div>\n</div>\n<div class=\"work_section no_margin col_full_stretch\">\n  <div class=\"col\">\n    <figure>\n      <img\n      src=\"/assets/images/work/fb_content_warnings/exploration_settings_2.png\"\n      />\n    </figure>\n  </div>\n</div>\n<hr>\n<div class=\"work_section col_full\">\n  <div class=\"col\">\n    <h2>\n      The final push\n    </h2>\n    <p>\n      During the next few weeks after the research session, I worked with my\n      team to execute on our launch plan for our MVP. Taking into consideration\n      the: 1) deadline, 2) legal and technical possibilities, and 3) necessary\n      features to solve our core user problem, we worked through all of the\n      implementation details, from the UI/UX design, to meeting policy and\n      legal requirements, to working closely with our marketing and\n      communication partnerships.\n    </p>\n    <h2>\n      <strong>In April 2017, the content warning launched to all platforms\n      (web, iOS, Android) to 100% of Facebook’s global market, viewable most\n      popularly on the News Feed.</strong>\n    </h2>\n  </div>\n</div>\n<div class=\"work_section no_margin col_full_stretch\">\n  <div class=\"col\">\n    <figure>\n      <img src=\"/assets/images/work/fb_content_warnings/project_overview.png\" />\n    </figure>\n  </div>\n</div>","frontmatter":{"title":"Helping people deal with unwanted content online with content warnings.","subtitle":"A holistic, involved approach from product definition to execution across multiple validation cycles, international research, and cross-organizational alignment.","reference":"fb_cw"}}},"pageContext":{"slug":"/works/fb_content_warnings/"}}