{"data":{"markdownRemark":{"html":"<img src=\"/assets/images/2018_08_18/lyon_1.png\" alt=\"Lyon\" />\n<p>Today marks two weeks since I’ve been in Lyon, France. People have asked me how\nit’s been and what I’ve been doing. Frankly, it’s been quite mundane: getting\ngroceries, drawing, going to the cafe to read, climbing at the gym. Here, I do all\nthe things I was already doing at home. However, the mere fact that this all\ntakes place in a foreign country has accentuated such quotidien experiences.\nHere are some musings from my life here so far:</p>\n<h3>The language barrier is frustrating, but it’s not insurmountable.</h3>\n<p>Even though I’ve taken about 4.5 years of school French and have practiced\non-and-off over the years, I struggle a lot with conversational French — mostly\nin my listening comprehension. As someone who prides herself on being a warm\nand attentive listener to her peers, it’s been a huge blow to not be able to\nalways understand what people are saying and to misinterpret the context. Often\nthis leads to frustration, but then I remember that this frustration stems\nprimarily from the pressure I put on myself and from my ego to escape shame or\nembarassment. In moments where I remember this, I try to laugh about it with\nthe person I'm talking with as well.</p>\n<p>And so, in order to improve my French, I’ve sought out language\nconversation exchange partners, and have been watching and listening to French\nmedia on YouTube, Netflix, and podcasts with subtitles and transcriptions. I’ve\nalso been reading more in French in order to\naugment my vocabulary and grammar comprehension. Lastly, I will begin a 2-week\ncrash course in French starting Monday at <a href=\"https://www.aflyon.org/en/\">Alliance Française</a>.</p>\n<h3>Slowing down feels foreign.</h3>\n<p>I came to Lyon in the middle of August, which is the time\nof the year when locals go on vacation and businesses close down for the\nsummer. With the city quietly resting, I've experienced bouts of restlessness\nin this stillness. As an American who was living a fast-paced life back in the\nBay Area, I wasn’t acclimated to a pace where people take time to feel the moments of a moment, to enjoy the espresso while looking outwards with no specific goal or vision in mind, to create space for conversation and for dining.\nMy favorite part of the day is apéro — the time of the late\nafternoon/early evening when people join their close ones to enjoy a drink and\nsnacks before dinner.</p>\n<p>While this slowness has perturbed my over-active, over-stimulated brain, I also\nthink it's been healthy for me to internalize an approach of living that isn't\nalways goal-oriented.</p>\n<img src=\"/assets/images/2018_08_18/sunset.png\" alt=\"Lyon\" />\n<h3>Despite having 100% of free time, priorities and structure still reign.</h3>\n<p>I’ve found it helpful to build some structure into my day in order to have some\nsanity. I organize my days into 3 main chunks: the morning, the afternoon, and\nthe evening. </p>\n<h4>Mornings</h4>\n<p>I spend my mornings working on my art practice (en plein air or on\nother projects), reading, writing, and hanging out at the local cafe. I’ve\nalways loved mornings, and that doesn’t seem to change even in a new locale.</p>\n<img src=\"/assets/images/2018_08_18/art_supplies.png\" alt=\"Lyon\" />\n<h4>Afternoons</h4>\n<p>I can’t quite recall what I’ve done in my afternoons, but it’s\nbeen filled with miscellaneous activity: going to the museum, shopping for\ngroceries, running errands, and apero! When I start my French course next week,\nI will be spending my afternoons doing that.</p>\n<img src=\"/assets/images/2018_08_18/friends_musee.png\" alt=\"Lyon\" />\n*Me with my two friends, Jorge and Amy, at Musée des Confluences.*\n<h4>Evenings</h4>\n<p>After apero, I might do a number\nof things: meeting up with a friend, getting dinner with people, watching a\nfree music show at l’Opéra de Lyon, enjoying the sunset, sitting by the river. When the\ncity picks back up, I look forward to watching more live music and other\nentertainment.</p>\n<h3>Conclusion</h3>\n<p>Overall, it's been quite lovely, and also mundane and true and simple in the\nway life just is. Everyday I wake up surprised and grateful that I get to have\nthis experience that I've thought about for so long.</p>","frontmatter":{"title":"Two Weeks","date":"2018-08-18 15:07 UTC"}}},"pageContext":{"slug":"/2018_08_18_two-weeks/"}}