{"data":{"markdownRemark":{"html":"<p>Ever since I decided to go to France, people haved asked me:</p>\n<blockquote>\n<p>Why France?</p>\n</blockquote>\n<p>… And  everytime I answer the question to a different person, my response\nmodifies slightly as I tacitly reflect upon my reasoning through quiet moments\nhere.</p>\n<p>I linger on this question because each time I think about it, I acknowledge\nthe contractions within my reasoning. Half of me is in France because there\nare many aspects of French culture that I appreciate: its food habits, its\nlanguage, its art movements and its philosophies. I love easily picking up\nrich, affordable baguettes from the plethora of available boulangeries, as\nwell as how people seize the moment and taste of their meal and their drinks.\nI love the sound and grammar of the French language, despite the frustration\nthat the countless verb tenses cause me. My first art history class happened\nin the 3rd grade, when my teacher introduced the class to Claude Monet and to\nImpressionism. Moreover, I romantize how some of my favorite artists and\nwriters are either from France, or have spent time in France, including James\nBaldwin, Angela Davis, and Henri Matisse. Is there something hidden within the\nmelange of the food, the language, the art community, and the way of being\nthat enabled such revolutionary thinkers and artists to develop and refine\nground-breaking truths? I wanted to see what they saw, to feel what they felt,\nhence why I decided to come to France.</p>\n<p>I can acknowledge all of this <em>and</em> recognize how this culture has molded\nitself over centuries from its absorption and willful domination of other\npeoples, given its position as a dominant Western European country.  In\n\"Cultural Identity and Diaspora\", Stuart Hall asserts that cultural identity is\n\"not an essense but a positioning.\" And I'm interested in comparing how the two\ncountries' positioning of one another shapes its inhabitents' understanding and\nembrace of the other culture. Having grown up and been educated in the United\nStates, I have observed America’s admiration of French culture — perhaps\nsomething I have also internalized. As twin peers of Western hegemonic power,\nthe United States and France straddle a similar level of global dominance —\neconomically, politically, culturally.  Perhaps it is this ability for United\nStates to regard France as an equal that such porous exchange of the cultural\nvalue (shall we say — democratic?) exists between these two countries.</p>\n<p>To materially trace the beginnings of my Francophilia is to revisit moments of\nmy youth in which France’s cultural values had already permeated my education\n— from the public classroom, to what I listened to and watched in the media,\nto the laws under which I was governed.</p>\n<p>Case in point: from my observation, the typical art history course in an\nAmerican high school isdominated by the stories and portrayals of mostly\nwhite, Western male artists (unless you specifically sought out the\n“specialized” histories of those in Asia or Africa, for example). That’s perhaps\nwhy it’s been easy for to gravitate towards Monet, Renoir, and Cezanne as\nmodels to follow: because my Western education has been shaped by white,\nstraight male hegemony to prioritize and diffuse the stories of those like\nthem, all the while portraying other voices — those of women, people of color,\nqueer, immigrant — as exotic “others” that remain on the outskirts of the\ncreative canon.</p>\n<p>Conversely, I've observed how American cultural dominance has also penetrated\nthat which people choose to consume here. Sometimes, I find myself in\nconversations where other French peers my age know more about certain American\nmovies and TV shows than I do myself! When I went to an underground,\nalternative, music event, I was amused to find that all of the musicians sang\ntheir song in English. All in all, there is a demand and appetite for embracing\nAmerican culture --- because for all the negative reputation that American has\ndeservedly garnered, it still uploads itself as a beacon of progress\nand democracy, constructioning and spreading evidence of such political and\ncultural capital through Hollywood and other popular media.</p>\n<p>I'm continuing to observe, experience, and\nunderstand my time here as an Asian-American woman from California in France,\nbut that deserves its own post. </p>","frontmatter":{"title":"Why France?","date":"2018-08-28 09:28 UTC"}}},"pageContext":{"slug":"/2018_08_28_why_france/why_france/"}}