{"data":{"markdownRemark":{"html":"<img src=\"/assets/images/2018_09_28_christine_blasey_ford.JPG\" alt=\"Christine Blasey Ford\" />\n<p>Yesterday was a hard day to sit in France and to be away from America. It was\nThursday, September 27, 2018 — the day of Senate  hearings around Dr. Christine\nBlasey Ford’s allegations of being sexually assaulted by Judge Brett Kavanaugh\nwhen they were both in high school.</p>\n<p>With France’s timezone six hours ahead of that of the east coast, and nine\nhours of the west coast, it took me awhile to internalize the solidarity with\nall of my friends, family, and communities in the United States. It was during\nmy mid-late afternoon here in Lyon that morning began in D.C. with the Senate\nhearings. It was when my Instagram and Facebook began to flood with hashtags\nlike #WeBelieveSurvivors and #CancelKavanaugh and with articles, video clips,\nexcerpts, readings, and other formats focused on the issue. Since I don’t have\nany American friends nor really know any American here in Lyon, I went\nthroughout the day not really talking about this with anyone. It was weird to\nacknowledge that a monumental proceeding that will live in history books for\ndecades to come was happening back at home, while I was here strolling through\nthe typically European cobblestone and narrow pathways, past people\nnonchalently enjoying their smoke, wine, and conversation that buzzed about.\nAnd rather than seeking out a new concert or bar to try out in the evening last\nnight at 11pm, I opted to buy a bottle of wine and just sit in the kitchen of\nthe apartment to stream the hearings.</p>\n<p>I imagined the parallel version of yesterday had I been in the states. I would\nhave gone into work in the morning, and this would have been a major topic of\nwatercooler conversation with my colleagues; we would have mentioned the\nseverity of it and have scheduled meetings around the hearings so that we could\nstream it remotely from our computers, all the while continuing to concentrate\non the day’s work, if we were successful, at all.  At some point during such a\nshitty day, I would have likely texted a few of my friends to try to meet up in\nthe evening to decompress and to support each other. Maybe we would have gone\nto Telegraph because of their ample, communal patio seating with a decent\nselection of beer and burgers. Emphasis on the word “communal”, for it would\nput us in direct, physical contact with others who’d palpably feel as we did;\neven if we never spoke to them, we would know that the whole crowd felt\nequivalently tense, disappointed, nervous, anxious. After a few hours, I would\nhave driven home and stumbled through my front door and plop myself in front of my laptop\ncomputer, checking Facebook, the news, Twitter, and Instagram again for any new\nupdates, insights, and conversations.</p>\n<p>It’s easy for me to imagine what it’s like to proceed through a day like this\nin America. A day where you go about your normal routine with work and personal\nlife, set against the backdrop of a major political and social events elsewhere\n(or everywhere?) in the country. It’s because we have a lot of those days. For\nsome, those days cut them directly, whereas for others, they feel more like a\nbruise. With struggle and oppression come resistance and empowerment. I think\nthat is why the entire nation gripped itself to the courage and heroism of Dr.\nFord’s confession. </p>\n<p>It’s hard to follow the dialogue around Kavanaugh’s possible confirmation to\nthe highest court of the country because it reiterates the despicable privilege\nthat white, straight, male America strives desperately to maintain. It makes me\nangry, and also sometimes powerless. Nevertheless, I felt proud to also learn\nabout the various protests and acts of resistance echoing and rumbling through\nthe multi-faceted, varied landscape that is our country. The people who risk\ntheir safety to speak out about  experiencing sexual assault and violence in\nthe workplace, on college campuses, in intimate corners of a home, and\nelsewhere. Those that listen and support, even if the ways in which one\nsupports may not always be clear. Those that begin to acknowledge how their\ncurrent or past behaviors have perpetuated misogyny or sexual violence, and\nseek to unlearn and untrain such habits. Those that begin to see what a more\njust world could look like, and then slowly walk towards that path. </p>\n<p>Being far away from America on a day like yesterday reminded me of the heart\nand soul that people posess so deeply to fight even despite the seemingly\ninsurmountable hierarchy undergirding our entire society. I’m nervous about the\nresults of today. But to help me deal with it, I want to focus on what I’m\ncapable of doing for my country in the skill I know best: drawing. So I’m going\nto continue to try to draw and make art to help spread messages and build\nawareness and empathy.</p>","frontmatter":{"title":"Watching America From a Distance #BelieveChristine","date":"2018-09-28 12:20 UTC"}}},"pageContext":{"slug":"/2018/09/2018_09_28_watching_america_from_a_distance/"}}