{"data":{"markdownRemark":{"html":"<p>\n  \n  <a class=\"gatsby-resp-image-link\" href=\"/static/defa1d50249f6ffceeb199693aa8ba50/0fdcb/featured_image.jpg\" style=\"display: block\" target=\"_blank\" rel=\"noopener\">\n  \n  <span class=\"gatsby-resp-image-wrapper\" style=\"position: relative; display: block;  max-width: 640px; margin-left: auto; margin-right: auto;\">\n    <span class=\"gatsby-resp-image-background-image\" style=\"padding-bottom: 75%; position: relative; bottom: 0; left: 0; background-image: url(&apos;data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAPABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAIDBAX/xAAWAQEBAQAAAAAAAAAAAAAAAAABAgP/2gAMAwEAAhADEAAAAYpZs3Gdgs//xAAZEAACAwEAAAAAAAAAAAAAAAABAgADERL/2gAIAQEAAQUC3A1nUAcxa3YCjiC1gP/EABYRAQEBAAAAAAAAAAAAAAAAAAABEf/aAAgBAwEBPwFlf//EABYRAQEBAAAAAAAAAAAAAAAAAAABEf/aAAgBAgEBPwGtj//EABwQAAMAAQUAAAAAAAAAAAAAAAABESECEBJBcf/aAAgBAQAGPwLvG2Kx1FnL0i0o/8QAGxABAAIDAQEAAAAAAAAAAAAAAQARITFRYXH/2gAIAQEAAT8hSF/StysBd9mUAdqAR5zl1LNh5g+OB2f/2gAMAwEAAgADAAAAEGwP/8QAFhEAAwAAAAAAAAAAAAAAAAAAARAR/9oACAEDAQE/EIVf/8QAFxEBAQEBAAAAAAAAAAAAAAAAAQARIf/aAAgBAgEBPxAC2PL/xAAdEAACAgMAAwAAAAAAAAAAAAABEQAhMUGBcZHR/9oACAEBAAE/EA8TUZODFtAAiW/sFk8HAzctTuH6Kaw6JkvEDqIFS+T/2Q==&apos;); background-size: cover; display: block;\">\n      <img class=\"gatsby-resp-image-image\" style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\" alt=\"{image_description}\" title=\"\" src=\"/static/defa1d50249f6ffceeb199693aa8ba50/128ae/featured_image.jpg\" srcset=\"/static/defa1d50249f6ffceeb199693aa8ba50/08cbc/featured_image.jpg 160w,\n/static/defa1d50249f6ffceeb199693aa8ba50/37ac5/featured_image.jpg 320w,\n/static/defa1d50249f6ffceeb199693aa8ba50/128ae/featured_image.jpg 640w,\n/static/defa1d50249f6ffceeb199693aa8ba50/e34c6/featured_image.jpg 960w,\n/static/defa1d50249f6ffceeb199693aa8ba50/b9765/featured_image.jpg 1280w,\n/static/defa1d50249f6ffceeb199693aa8ba50/5e6b5/featured_image.jpg 1920w,\n/static/defa1d50249f6ffceeb199693aa8ba50/0fdcb/featured_image.jpg 4032w\" sizes=\"(max-width: 640px) 100vw, 640px\">\n    </span>\n  </span>\n  \n  </a>\n    \n</p>\n<p>During one of my many aimless strolls the other day, it dawned on me that I\nhave been in France for 6 weeks, which is the midway point of my sojourn here.\nEncountering this realization left me with a lot of mixed feelings: shouldn’t I\nhave drawn or written or eaten or met more people or spoken better French or\ndone more of this or that? I was catching myself comparing my expectations of\nhow I <em>thought</em> things would be like when I planned this trip months ago, to\nhow things were panning out.</p>\n<p>It reminds me of myself when I was in college. I’d have this urge to express\nthe fact of the moment out loud. Even while in the midst of it — holed up in\nOlin Library at 11pm with another 30 pages to read, walking across\nsnow-blanketed Foss Hill in the heart of winter after a blizzard, having the\nfirst heart-to-heart with an acquaintance that’d turn out to be a true life\nfriend — I tried to actively acknowledge the unique, time-boxed ephermality of\nthe quintessential American college experience. How? I would blurt out to\nwhomever I was with:</p>\n<blockquote>\n<blockquote>\n<p>“you guys, we’re in college!” </p>\n</blockquote>\n</blockquote>\n<p>And I keep having a similar feeling while I’m here in France (except I don’t\nexclaim anything out loud because these moments occur most often when I’m\nalone). Such quiet moments feel like any other I’d have in the states, but they\nfeel different simply because I’m living amidst the backdrop of a foreign\ncountry.</p>\n<p>Knowing that my stay in France has a clear end date makes me feel guilty for\nnot doing “more.” Right now, I’m sitting in my apartment and writing this blog\nentry, instead of being out and taking in the lively European nightlife. And\nperhaps I feel guilty about not having eaten at enough fine dineries here in\nthe reputed food capital of France (though my wallet certainly\ndoesn’t feel guilty about that!).</p>\n<p>The way these minor pangs of guilt coalesce with other hiccups throughout my\nstay — trying to find housing last-minute, getting lost in translation with\ncomplete strangers — feel like stumbling. To think you’re moving forward, until\nsomething grips you in your tracks and trips you up. Like when you begin to have more comfortable\ninteractions with strangers in French, yet suddenly, when a young woman at the\ngym accidentally bumps into you and apologizes with a French <em>“pardon”</em>,  you\nfind yourself startled, voiceless, inarticulate. The moment passes and you\ndidn’t respond to her apology.</p>\n<p><strong>Stumbling is moving along confidently, only to slip off from an unforeseen\ncrack on the sideback.</strong> To advance towards your destination, only to\nmiscalculate how you’ll get there or how long it’ll take. Stumbling can feel\nlike a lot like stillness.</p>\n<p>But here is the thing about stumbling too: it opens new possibilities. When you\nmisstep, you’re poised to observe an ordinary situation from a different angle.\nThere have been many instances in which someone has bumped into me and apologized, to\nwhich I’ve subsequently responded: “no worries”, “no problem”, “don’t worry\nabout it”, “it’s okay”.</p>\n<p>How easy is it for me to automatically conjure these idiomatic English phrases.\nPerhaps it's because I had already stumbled through this exact scenario before: I\ncan’t recount when, exactly, but perhaps maybe when I was 3 or 4 and was\nlearning how to express manners in English. When I reflect on not having\nresponded to the French woman at the gym apologizing to me what I fear most is\nhaving come off as rude or impolite.</p>\n<p>This distinct moment of a minor stumble reminded of me of own values and\nprinciples. It's inevitable that I'll uncover more of the worldview I've\nalready constructed and probably take for granted as I continue to stumble,\nparticularly during the second part of my stay in France.</p>\n<p>I'm not sure what I will unfold in next few weeks, nor do I want to imagine\nthat they'll materialize as something conspicuously grand or dramatic or\nthrilling. I want to be open to anything in my path - big and small, loud and\nmuted. I hope that as I stumble, I can rise again and continue on the path that\nI am on and, in fact, have always been on.</p>","frontmatter":{"title":"On Stumbling","date":"September 13, 2018","subtitle":"Pushing oneself towards the edge of their comfort zone when learning a new language in a foreign country","featured_image":{"childImageSharp":{"sizes":{"src":"/static/defa1d50249f6ffceeb199693aa8ba50/5bc5b/featured_image.jpg"}}}}}},"pageContext":{"slug":"/2018/09/on_stumbling/"}}